README.org
#+TITLE: My NixOS Configuration
#+OPTIONS: toc:nil broken-links: t
#+PROPERTY: header-args  :noweb tangle :results silent :mkdirp yes
#+STARTUP: content

Hello! This is my [[https://nixos.org/][NixOS]] configuration that I use to maintain my machines. 

The machines:
- ~lenovo~
- ~server~

I use [[https://orgmode.org/][org-mode]] in [[https://www.gnu.org/software//emacs/][emacs]] to manage my NixOS configuration.

To use this repo:
- First clone the repo
- Assuming you've emacs installed in your nixos system, run the command below
#+begin_src bash :tangle no
   emacs README.org --batch -f org-babel-tangle
#+end_src
   The above will generate all the .nix files.
- Then run the nixos-rebuild command
#+begin_src bash :tangle no
   sudo nixos-rebuild switch --flake .#<lenovo/server>
#+end_src
- For [[https://github.com/nix-community/home-manager][Home-Manager]] configuration, run the following while being in the repo directory.
#+begin_src bash :tangle no
   home-manager switch --flake .#kin-lenovo
#+end_src
   I only have one home-manager user configured, and that is for my ~lenovo~ machine.
   
* The Flake File
In NixOS flakes are used to package and manage Nix projects, flakes are used as a way to produce reproducible builds as well as controlling multiple systems.

I also use flakes as a way to import my non-flake files and use it to import files within the various non-flake git repositories, example of this last statment is the input named ~walls~ that fetches from [[https://codeberg.org/kinest/walls][my repo]] that stores wallpapers, this is later used in [[modules/features/wm/niri.nix#L218][Niri]] along with [[https://swaybg.com/][Swaybg]].

#+begin_src nix :tangle flake.nix
  {
    inputs = {
      nixpkgs.url = "github:nixos/nixpkgs/nixos-unstable";
      flake-parts.url = "github:hercules-ci/flake-parts";
      import-tree.url = "github:vic/import-tree";
      wrapper-modules.url = "github:BirdeeHub/nix-wrapper-modules";
      prismlauncher.url = "github:PrismLauncher/PrismLauncher?ref=release-9.x";
      xwayland-satellite-unscaled.url = "github:Supreeeme/xwayland-satellite?ref=unscaled-dpi";
      redlib-fork.url = "github:taglia/redlib?ref=dockerhub-redlib-0.36.0";

      secrets = {
        url = "git+ssh://git@codeberg.org/kinest/secrets?ref=main&shallow=1";
        flake = false;
      };
      walls = {
        url = "git+ssh://git@codeberg.org/kinest/walls?ref=main&shallow=1";
        flake = false;
      };
      custom-fonts = {
        url = "git+ssh://git@github.com/kinestt/custom-fonts?ref=main&shallow=1";
        flake = false;
      };

      emacs-overlay = {
        url = "github:nix-community/emacs-overlay";
        inputs.nixpkgs.follows = "nixpkgs";
      };
      helium = {
        url = "github:schembriaiden/helium-browser-nix-flake";
        inputs.nixpkgs.follows = "nixpkgs";
      };
      home-manager = {
        url = "github:nix-community/home-manager";
        inputs.nixpkgs.follows = "nixpkgs";
      };
      sops-nix = {
        url = "github:Mic92/sops-nix";
        inputs.nixpkgs.follows = "nixpkgs";
      };
      nixflix = {
        url = "github:kiriwalawren/nixflix";
        inputs.nixpkgs.follows = "nixpkgs";
      };
      nvf = {
        url = "github:notashelf/nvf";
      };
      nur = {
        url = "github:nix-community/NUR";
        inputs.nixpkgs.follows = "nixpkgs";
      };
      omnisearch = {
        url = "git+https://git.bwaaa.monster/omnisearch";
        inputs.nixpkgs.follows = "nixpkgs";
      };    
    };

    outputs = inputs: inputs.flake-parts.lib.mkFlake {inherit inputs;} (inputs.import-tree ./modules);
  }
#+end_src

* Parts 
#+begin_src nix :tangle modules/parts.nix
  {
    config = {
      systems = [
        "x86_64-linux"
        "x86_64-darwin"
        "aarch64-linux"
        "aarch64-darwin"
      ];
    };
  }
#+end_src
* Hosts
The default hosts structure goes as follows
1. default.nix 
2. configuration.nix
3. hardware.nix 
** Default   
*** Lenovo Laptop 
#+begin_src nix :tangle modules/hosts/lenovo/default.nix 
  {
    withSystem,
    self,
    inputs,
    ...
  }: {
    flake.nixosConfigurations.lenovo = inputs.nixpkgs.lib.nixosSystem {
      modules = [
        self.nixosModules.lenovoConfiguration
        ({pkgs, ...}: {
          nixpkgs.config.allowUnfree = true;
          nixpkgs.overlays = [
          ];
        })
      ];
    };
  }
#+end_src
*** Server 
#+begin_src nix :tangle modules/hosts/server/default.nix 
  {
    withSystem,
    self,
    inputs,
    ...
  }: {
    flake.nixosConfigurations.server = inputs.nixpkgs.lib.nixosSystem {
      modules = [
        self.nixosModules.serverConfiguration
      ];
    };
  }
#+end_src
** Configuration 
*** Lenovo Laptop
#+begin_src nix :tangle modules/hosts/lenovo/configuration.nix
  {
    self,
    inputs,
    ...
  }: {
    flake.nixosModules.lenovoConfiguration = {
      pkgs,
      ...
    }: {
      imports = [
        self.nixosModules.lenovoHardware
        self.nixosModules.niri
        self.nixosModules.ly
        self.nixosModules.pipewire
        self.nixosModules.yazi
        self.nixosModules.vim
        self.nixosModules.nvf
        self.nixosModules.tmux
        self.nixosModules.foot
        self.nixosModules.bash
        self.nixosModules.fish
        self.nixosModules.bash
        self.nixosModules.customFonts
      ];

      #boot.loader.systemd-boot.enable = true;
      boot.loader.grub = {
        enable = true;
        device = "nodev";
        efiSupport = true;
        useOSProber = true;
      };
      boot.loader.efi.canTouchEfiVariables = true;

      networking.hostName = "lenovo";

      networking.networkmanager.enable = true;
      time.timeZone = "Asia/Kolkata";

      users.users.kin = {
        isNormalUser = true;
        extraGroups = ["wheel"];
        shell = pkgs.bash;
        home = "/home/kin/";
        packages = with pkgs; [
          libnotify
          usbutils
          glib
          wine-wayland
          protontricks
          wget
          home-manager
          bat
          unzip
          zip
          spotify

        ];
      };

      services.gvfs.enable = true;

      nix.settings.experimental-features = ["nix-command" "flakes"];

      programs = { 
        dconf.enable = true;
        localsend.enable = true;
      };

      hardware.graphics.enable = true;
      hardware.graphics.enable32Bit = true;
      #services.xserver.videoDrivers = ["nvidia"];
      #hardware.nvidia.open = true;
      #hardware.nvidia.modesetting.enable = true;
      # hardware.nvidia.prime = {
      #   sync.enable = true;
      #   amdgpuBusId = "PCI:06:0:0";
      #   nvidiaBusId = "PCI:01:0:0";
      # };

      environment = { 
        systemPackages = with pkgs; [
          git
          mullvad
          mullvad-vpn
          inputs.xwayland-satellite-unscaled.packages.${pkgs.system}.xwayland-satellite

          #(pkgs.spotify.overrideAttrs (old: {
          #  nativeBuildInputs = (old.nativeBuildInputs or []) ++ [
          #    pkgs.makeWrapper
          #  ];
          #  postInstall = (old.postInstall or "") + ''
          #    wrapProgram $out/bin/spotify \
          #      --add-flags "--enable-features=UseOzonePlatform"\
          #      --add-flags "--ozone-platform=wayland"
          #  '';
          #}))
        ];
        variables = {
          EDITOR = "vim";
        };
        sessionVariables = {
          NIXOS_OZONE_WL = "1";
        };
      };

      hardware.bluetooth = {
        enable = true;
        powerOnBoot = true;
      };

      networking.wireless.enable = false;
      networking.wireless.iwd.enable = true;
      networking.networkmanager.wifi.backend = "iwd";

      services.mullvad-vpn = {
        enable = true;
      };
      
      swapDevices = [
        { 
          device = "/var/lib/swapfile";
          size = 64 * 1024;
        }
      ];
      system.stateVersion = "25.11";
    };
  }
#+end_src
*** Server
#+begin_src nix :tangle modules/hosts/server/configuraion.nix 
  {
    self,
    inputs,
    ...
  }: {
    flake.nixosModules.serverConfiguration = {
      config,
      pkgs,
      ...
    }: let
      secretspath = builtins.toString inputs.secrets;
    in {
      imports = [
        self.nixosModules.serverHardware
        self.nixosModules.vim
        self.nixosModules.nvf
        self.nixosModules.tmux
        self.nixosModules.searxng
        self.nixosModules.nginx
        self.nixosModules.qbittorrent
        self.nixosModules.vaultwarden
        self.nixosModules.komga
        self.nixosModules.miniflux
        self.nixosModules.nixflix
        self.nixosModules.redlib
        self.nixosModules.docker
        self.nixosModules.fish
        self.nixosModules.bash
        self.nixosModules.yazi
        self.nixosModules.stirlingpdf
        self.nixosModules.whatmp3
        self.nixosModules.linkwarden
        self.nixosModules.invidious

        inputs.sops-nix.nixosModules.sops
      ];

      boot.loader.systemd-boot.enable = true;
      boot.loader.efi.canTouchEfiVariables = true;
      #boot.kernelPackages = pkgs.linuxPackages_latest;
      nix.settings.experimental-features = ["nix-command" "flakes"];
      users.users.kin = {
        isNormalUser = true;
        description = "kin";
        extraGroups = ["wheel" "docker"];
        shell = pkgs.bash;
        home = "/home/kin";
      };

      virtualisation.docker = {
        enable = true;
      };
      
      sops = {
        defaultSopsFile = "${secretspath}/secrets/server.yaml";
        age = {
          sshKeyPaths = ["${config.users.users.kin.home}/.ssh/id_ed25519"];
          keyFile = "/var/lib/sops-nix/key.txt";
          generateKey = true;
        };
        secrets = {
          lidarr_api_key = {};
          lidarr_api_env = {};
          radarr_api_key = {};
          radarr_api_env = {};
          sonarr_api_key = {};
          sonarr_api_env = {};
        };
      };
      boot.loader.grub.device = "/dev/nvme0n1p1";
      environment.systemPackages = with pkgs; [
        git
        bat
        htop
        home-manager
        ntfs3g
        brightnessctl
        gh
        fastfetch
        age
        kitty
        sops
        compose2nix
        unzip
        zip
        streamrip
        ffmpeg
      ];
      networking = {
        hostName = "server";
        useDHCP = true;
        firewall = {
          enable = false;
          allowedTCPPorts = [25575 25565 80 443 7878 8989 9696 42010];
          allowedUDPPorts = [19132 5544 25565];
          extraCommands = "  iptables -t mangle -A POSTROUTING -p tcp --tcp-flags SYN,RST SYN \
          -j TCPMSS --clamp-mss-to-pmtu";
        };
        interfaces = {
          eno1 = {
            mtu = 1250;
          };
        };
      };
      swapDevices = [
        {
          device = "/.swapfile";
          size = 16 * 1024; # Size in Megabytes
        }
      ];
      time.timeZone = "Asia/Kolkata";
      services.openssh.enable = true;
      system.stateVersion = "25.11"; # Did you read the comment?
    };
  }
#+end_src
** Hardware
*** Lenovo Laptop
#+begin_src nix :tangle modules/hosts/lenovo/hardware.nix 
  {
    self,
    inputs,
    ...
  }: {
    flake.nixosModules.lenovoHardware = {
      config,
      lib,
      pkgs,
      modulesPath,
      ...
    }: {
      imports = [
        (modulesPath + "/installer/scan/not-detected.nix")
      ];

      boot.initrd.availableKernelModules = ["nvme" "xhci_pci" "ahci" "usbhid" "usb_storage" "sd_mod"];
      boot.initrd.kernelModules = [];
      boot.kernelModules = ["kvm-amd"];
      boot.extraModulePackages = [];

      fileSystems."/" = {
        device = "/dev/disk/by-uuid/63be889f-1491-47be-bc6c-820884e007b9";
        fsType = "ext4";
      };

      fileSystems."/boot" = {
        device = "/dev/disk/by-uuid/6728-D654";
        fsType = "vfat";
        options = ["fmask=0022" "dmask=0022"];
      };

      #swapDevices = [
      #  {device = "/dev/disk/by-uuid/7f2a8bf2-2460-4446-bdec-327811c5be57";}
      #];  

      nixpkgs.hostPlatform = lib.mkDefault "x86_64-linux";
      hardware.cpu.amd.updateMicrocode = lib.mkDefault config.hardware.enableRedistributableFirmware;
    };
  }
#+end_src
*** Server
#+begin_src nix :tangle modules/hosts/server/hardware.nix 
  {
    self,
    inputs,
    ...
  }: {
    flake.nixosModules.serverHardware = {
      config,
      lib,
      pkgs,
      modulesPath,
      ...
    }: {
      imports = [
        (modulesPath + "/installer/scan/not-detected.nix")
      ];

      boot.initrd.availableKernelModules = ["nvme" "xhci_pci" "ahci" "usb_storage" "usbhid" "sd_mod"];
      boot.initrd.kernelModules = [];
      boot.kernelModules = ["kvm-amd"];
      boot.extraModulePackages = [];

      fileSystems."/" = {
        device = "/dev/disk/by-label/NIXROOT";
        fsType = "ext4";
      };

      fileSystems."/boot" = {
        device = "/dev/disk/by-label/NIXBOOT";
        fsType = "vfat";
        options = ["fmask=0022" "dmask=0022"];
      };
      fileSystems."/mnt/external-hdd" = {
        device = "/dev/disk/by-uuid/e6ab5a96-b8f5-4081-ba4a-5d2dca6f3bb5";
        fsType = "ext4";
        options = ["nofail"];
      };

      nixpkgs.hostPlatform = lib.mkDefault "x86_64-linux";
      hardware.cpu.amd.updateMicrocode = lib.mkDefault config.hardware.enableRedistributableFirmware;
    };
  }
#+end_src
* Features
** Applications
*** Bash
#+begin_src nix :tangle modules/features/apps/bash.nix 
  {
    self,
    inputs,
    ...
  }: {
    flake.nixosModules.bash = {
      lib,
      pkgs,
      ...
    }: let 
      nixosDir = "/home/kin/nixos";
    in {
      programs.bash = {
        enable = true;
        shellAliases = {
          nrs = "sudo nixos-rebuild switch --flake ${nixosDir}#$HOSTNAME";
          hms = "home-manager switch --flake ${nixosDir}#$USER-$HOSTNAME";
          y = "yazi";
          l = "${lib.getExe pkgs.lsd} -l";
          la = "${lib.getExe pkgs.lsd} -a";
          lla = "${lib.getExe pkgs.lsd}-la";
          lt = "${lib.getExe pkgs.lsd} --tree";
        };
        enableLsColors = true;
      };
    };
  }
#+end_src
*** Fish
#+begin_src nix :tangle modules/features/apps/fish.nix 
  {
    self,
    inputs,
    ...
  }: {
    flake.nixosModules.fish = {
      pkgs,
      ...
    }: {
      programs.fish = {
        enable = true;
        package = self.packages.${pkgs.stdenv.hostPlatform.system}.myFish;
      };
    };
    perSystem = {
      pkgs,
      config,
      ...
    }: let 
      nixosDir = "/home/$USER/nixos/";
    in { 
      packages.myFish = inputs.wrapper-modules.wrappers.fish.wrap {
        inherit pkgs;
        shellAliases = {
          nrs = "sudo nixos-rebuild switch --flake ${nixosDir}#$hostname";
          hms = "home-manager switch --flake ${nixosDir}#$USER-$hostname";
        };
        plugins = with pkgs.fishPlugins; [
          pure
        ];
      };
    };
  }
#+end_src
