README.org
*** GTK
#+begin_src nix :tangle modules/home/home-modules/gtk.nix
  {
    self,
    ...
  }: {
    flake.homeModules.gtk = {
      pkgs,
      ...
    }: {
      gtk = {
        enable = true;
      };
      dconf = {
        enable = true;
        settings = {
          "org/gnome/desktop/interface".color-scheme = "prefer-dark";
        };
      };
      home.pointerCursor = {
        gtk.enable = true;
        x11.enable = true;
        name = "Bibata-Modern-Ice";
        package = pkgs.bibata-cursors;
      };
    };
  }
#+end_src

*** Helix
#+begin_src nix :tangle modules/home/home-modules/helix.nix
  { 
    ...
  }: {
    flake.homeModules.helix = {
      pkgs,
      ...
    }: {
      programs.helix = {
        enable = true;
        package = pkgs.evil-helix;
        settings = {
          theme =  "gruvbox_transparent";
        };
        themes."gruvbox_transparent" = {
          inherits = "gruvbox";
          "ui.background" = {};
        };
      };
    };
  }
#+end_src
*** Mako
#+begin_src nix :tangle modules/home/home-modules/mako.nix
  {
    self,
    inputs,
    ...
  }: {
    flake.homeModules.mako = {
      pkgs,
      ...
    }: {
      services.mako = {
        enable = true;
        package = self.packages.${pkgs.stdenv.hostPlatform.system}.myMako;
      };
    };
    perSystem = {
      pkgs,
      ...
    }: {
      packages.myMako = inputs.wrapper-modules.wrappers.mako.wrap {
        inherit pkgs;
        settings = {
          sort = "-time";
          font = "Iosevka Nerd Font Mono";
          layer = "overlay";
          anchor = "top-right";
          default-timeout = 5000;
          width = 300;
          height = 110;
          padding = "0,15,20";
          background-color = "#282828";

          "urgency=normal" = {
              border-color = "#458588"; # blue
          };

          "urgency=high" = {
              border-color = "#cc241d"; # red
              default-timeout = 0;
          };
        };
      };
    };
  }
#+end_src
*** Waybar
#+begin_src nix :tangle modules/home/home-modules/waybar.nix
  {
    ...
  }: {
    flake.homeModules.waybar = {
      ...
    }: {
      programs.waybar = {
        enable = true;
        settings = {
          mainBar = {
            layer = "top";
            position = "top";
            height = 25;
            spacing = 10;
            modules-left = ["niri/workspaces" "niri/window"];
            modules-center = [];
            modules-right = ["tray" "cpu" "memory" "battery" "clock#date" "clock#time"];
            "cpu" = {
              interval = 10;
              format = "Cpu:{usage}%";
            };
            "memory" = {
              interval = 30;
              format = "Ram:{}%";
            };
            "battery" = {
              format = "Battery:{capacity}%";
            };
            "clock#date" = {
              format = "Date:{:%d/%m(%a)}";
            };
            "clock#time" = {
              format = "Time:{:%I:%M %p} ";
              interval = 1;
            };
            "custom/seperator" = {
              format = " | ";
              tooltip = false;
            };
          };
        };
        style = "
        #waybar {
            font-family: 'Iosevka Nerd Font Propo';
            font-size: 16px;
            font-weight: normal;
            background-color: rgba(40, 40, 40, 1);
        }

        #cpu {
            color: #d3869b;
        }

        #memory {
            color: #8ec07c;
        }

        #battery {
            color: #fabd2f;
        }

        #clock.date {
            color: #fe8019;
        }

        #clock.time {
            color: #fb4934;
        }

        #window {
            color: #928374;
        }

        #workspaces button {
            all: initial;
            color: #928374;
            padding: 0 8px;
            margin: 0;
        }

        #workspaces button.active {
            color: #b8bb26;
        }

        #workspaces button:hover {
            color: #ebdbb2;
        }

        #custom-seperator {
            color: #7c6f64;
            padding: 0px;
        }
        ";
      };
    };
  }
#+end_src
* Logic
** homeModules
#+begin_src nix :tangle modules/logic/homeModules.nix
  {
    lib,
    moduleLocation,
    flake-parts-lib,
    ...
  }: let
    inherit
      (lib)
      mapAttrs
      mkOption
      types
      ;
    inherit
      (flake-parts-lib)
      mkSubmoduleOptions
      ;
  in {
    options = {
      flake = mkSubmoduleOptions {
        homeModules = mkOption {
          type = types.lazyAttrsOf types.deferredModule;
          default = {};
          apply = mapAttrs (k: v: {
            _class = "homeManager";
            _file = "${toString moduleLocation}#homeModules.${k}";
            imports = [v];
          });
          description = ''
            Home-Manager modules.

            You may use this for reusable pieces of configuration, service modules, etc.
          '';
        };
      };
    };
  }
#+end_src
* Emacs configuration
** Emacs Managed by nix
#+begin_src nix :tangle modules/home/home-modules/emacs/emacs.nix
  {
    ...
  }: {
    flake.homeModules.emacs = {
      pkgs,
      ...
    }: { 
      programs.emacs = {
        enable = true;
        package = (pkgs.emacs-pgtk.override { withTreeSitter = true; });

        extraPackages = epkgs: with epkgs; [
          evil
          nerd-icons
  				vterm
  				autothemer
  				nix-mode
          rainbow-mode
          pdf-tools
          emms
          base16-theme
        ];
      };

      home.file = {
        emacs = {
          source = ./init.el;
          target = ".emacs.d/init.el";
        };
        emacs-init = {
          source = ./early-init.el;
          target = ".emacs.d/early-init.el";
        };
  			emacs-custom = {
  				source = ./custom;
  				target = ".emacs.d/custom";
  				recursive = true;
  			};
      };
    };
  }
#+end_src
** early-init.el
#+begin_src emacs-lisp :tangle modules/home/home-modules/emacs/early-init.el
  ;;; early-init.el --- Early emacs configuration -*- lexical-binding: t; -*-

  (set-language-environment "UTF-8")

  (setq inhibit-startup-message 1)
  (setq-default
   default-frame-alist
   '((bottom-divider-width . 1)
     (horizontal-scroll-bars . nil)
     (menu-bar-lines . 0)
     (tool-bar-lines . 0)
     (set-fringe-mode 10)
     (vertical-scroll-bars . nil))
   tab-width 2 
   indent-tabs-mode nil
  )
#+end_src
** init.el
#+begin_src emacs-lisp :tangle modules/home/home-modules/emacs/init.el
  ;;; init.el --- Emacs configuration -*- lexical-binding: t; -*-

  ;; Keybinds
  (global-set-key (kbd "C-x a") #'org-agenda)
  (global-set-key (kbd "C-x c") #'org-capture)

  ;; Font 
  (set-frame-font "Iosevka Nerd Font Mono 12" nil t)

  ;; qol customizations
  (global-display-line-numbers-mode 1)
  (setq display-line-numbers-type 'relative)
  (global-hl-line-mode 0)
  (global-visual-line-mode 1)
  (column-number-mode 1)
  (show-paren-mode 1)
  (setq make-backup-files nil)
  (setq auto-save-default nil)

  ;; Custom folder which contains .el files that can be loaded by the load command
  (add-to-list 'load-path (expand-file-name "custom" user-emacs-directory))
  (load "rose-pine-color-theme")
  ;; (load-theme 'rose-pine-color t)

  ;; Base16 Theme
  (use-package base16-theme
    :ensure t
    :config
    (load-theme 'base16-gruvbox-dark t))

  ;; Evil Mode
  (use-package evil
    :init
    (setq evil-want-C-u-scroll t)
    :config
    (evil-mode 1))

  ;; Binding vterm
  (use-package vterm
  	:bind ("C-x C-t" . vterm))

  ;; Nix Mode for syntax highlighting
  (use-package nix-mode
  	:mode "\\.nix\\'")

  ;; Nerd Icons
  (use-package nerd-icons
  	:custom
  	(nerd-icons-color-icons nil))

  ;; Rainbow Mode
  (use-package rainbow-mode
    :hook (after-change-major-mode . rainbow-mode))

  ;; Pdf-tools
  (use-package pdf-tools
    :defer t
    :mode "\\.pdf\\'"
    :commands (pdf-loader-install)
    :bind (:map pdf-view-mode-map
                ("j" . pdf-view-next-line-or-next-page)
                ("k" . pdf-view-previous-line-or-previous-page)
                ("C-=" . pdf-view-enlarge)
                ("C--" . pdf-view-shrink))
    :init (pdf-loader-install)
    :config (add-to-list 'revert-without-query ".pdf"))
  (add-hook 'pdf-view-mode-hook #'(lambda () (interactive) (display-line-numbers-mode -1)))
  (add-hook 'pdf-view-mode-hook #'pdf-view-roll-minor-mode)

  ;; Emms
  (use-package emms
    :ensure t
    :config
    (require 'emms-setup)
    (emms-all)
    (emms-default-players)
    (setq emms-player-list '(emms-player-mpv)))
#+end_src
** Custom files
